test/asciiart-load-test.yml
config:
  target: "http://localhost"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Gradual Load"
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 500
        - http.response_time.p95: 250
scenarios:
  - name: "Basic GET Request"
    flow:
      - get:
          url: "/"